<img src="https://raw.githubusercontent.com/dm-fedorov/pandas_basic/master/pic/currency_cleanup.png">

In [1]:
import pandas as pd
import numpy as np

In [5]:
df_orig = pd.read_excel('https://github.com/dm-fedorov/pandas_basic/blob/master/%D0%B1%D1%8B%D1%81%D1%82%D1%80%D0%BE%D0%B5%20%D0%B2%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%B2%20pandas/data/sales_cleanup.xlsx?raw=True')
df = df_orig.copy()
df

         Customer      Sales
0  Jones Brothers        500
1       Beta Corp  $1,000.00
2     Globex Corp      300.1
3            Acme    $750.01
4         Initech        300
5           Hooli        250

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Customer  6 non-null      object
 1   Sales     6 non-null      object
dtypes: object(2)
memory usage: 228.0+ bytes

In [7]:
df.dtypes

Customer    object
Sales       object
dtype: object

In [9]:
# df['Sales'].astype('float') astype- метод преобраз типов данных

In [10]:
df['Sales'] = df['Sales'].str.replace('$', '')
df['Sales'] = df['Sales'].str.replace(',', '')
df['Sales']

0        NaN
1    1000.00
2        NaN
3     750.01
4        NaN
5        NaN
Name: Sales, dtype: object

In [11]:
df =  df_orig.copy()
df['Sales'].apply(type) # к кажд стр примен функц type

0      <class 'int'>
1      <class 'str'>
2    <class 'float'>
3      <class 'str'>
4      <class 'int'>
5      <class 'int'>
Name: Sales, dtype: object

In [14]:
df['Sales_type'] = df['Sales'].apply(lambda x: type(x).__name__)
df

         Customer      Sales Sales_type
0  Jones Brothers        500        int
1       Beta Corp  $1,000.00        str
2     Globex Corp      300.1      float
3            Acme    $750.01        str
4         Initech        300        int
5           Hooli        250        int

In [15]:
class name:
    """
    # __init__ - магич метод, он вызывается при наступленнии поределн события, триггерит  создание объекта/ вызывает метод автоматически при создании объекта 
    obj.__init__() -> не требуется это делать 
    """
    def __init__(self, name, age) -> None: # нерезультирующий(void), он выполняет операц но не выводит на экран
        self.name1 = name
        self.age1 = age
        # obj.name = name
        # obj1.name = name

# obj = name()
# obj1 = name()
# obj.name = 1

In [21]:
obj = name('name', 23) #создание объекта 
obj.age1

23

In [22]:
# приняли ф type, подсчет этих типов, использ часто 
df['Sales'].apply(type).value_counts()

Sales
<class 'int'>      3
<class 'str'>      2
<class 'float'>    1
Name: count, dtype: int64

In [25]:
number = 1235
number_string = '$1,235'
type(number), type(number_string) #  по умоланию jupyter возвр кортеж по умолч, при передачи данных через ',' / return tuple (int, str) ?

(int, str)

In [30]:
dir(number_string.replace('$', ''))

# number = 1
# number + 1 => number.__add__(2)

['__add__',
 '__class__',
 '__contains__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__getnewargs__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__mul__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rmod__',
 '__rmul__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'capitalize',
 'casefold',
 'center',
 'count',
 'encode',
 'endswith',
 'expandtabs',
 'find',
 'format',
 'format_map',
 'index',
 'isalnum',
 'isalpha',
 'isascii',
 'isdecimal',
 'isdigit',
 'isidentifier',
 'islower',
 'isnumeric',
 'isprintable',
 'isspace',
 'istitle',
 'isupper',
 'join',
 'ljust',
 'lower',
 'lstrip',
 'maketrans',
 'partition',
 'removeprefix',
 'removesuffix',
 'replace',
 'rfind',
 'rindex',
 'rjust',
 'rpartition',
 'rsplit',
 'rstrip',
 'split',
 'splitlines',
 'startswith',
 'strip',
 'swapcase',
 'title',
 'translate',
 'upper',
 'zfill']

In [35]:
float(number_string.replace('$', '').replace(',', ''))
# number_string.replace('$', '').replace(',', '').astype('float') # нету атрибута

1235.0

In [52]:
def clean_currency(x):
    """
    если значение явл стр, то удаляет смивол валбты и разделитель, иначе, знаеяние является числом 
    """
    if isinstance(x, str): return x.replace('$', '').replace(',', '')
    return x

clean_currency.__doc__ # показывает докуметацию

'\n    если значение явл стр, то удаляет смивол валбты и разделитель, иначе, знаеяние является числом \n    '

In [51]:
isinstance?

Signature: isinstance(obj, class_or_tuple, /)
Docstring:
Return whether an object is an instance of a class or of a subclass thereof.

A tuple, as in ``isinstance(x, (A, B, ...))``, may be given as the target to
check against. This is equivalent to ``isinstance(x, A) or isinstance(x, B)
or ...`` etc.
Type:      builtin_function_or_method

In [47]:
list_ = [1,2,3]
list_1 = list_

list_ is list_1, id(list_) == id(list_1) # переменные ссылаются на один и тот же обьъект 

del list_
list_1 # объект существует, garbage collection не пришел

del list_1 # garbage collection пришел и удалил объект из памяти (оптимизац памяти)

In [62]:
df['Sales'] = df['Sales'].apply(clean_currency).astype('float')
df['Sales']

0     500.00
1    1000.00
2     300.10
3     750.01
4     300.00
5     250.00
Name: Sales, dtype: float64

In [68]:
df['Sales_type'] = df['Sales'].apply(lambda x: type(x).__name__)
df['Sales_type']

0    float
1    float
2    float
3    float
4    float
5    float
Name: Sales_type, dtype: object

In [65]:
df

         Customer    Sales Sales_type
0  Jones Brothers   500.00      float
1       Beta Corp  1000.00      float
2     Globex Corp   300.10      float
3            Acme   750.01      float
4         Initech   300.00      float
5           Hooli   250.00      float

In [66]:
df.dtypes

Customer       object
Sales         float64
Sales_type     object
dtype: object

In [69]:
df['Sales'].apply(type).value_counts()

Sales
<class 'float'>    6
Name: count, dtype: int64

In [70]:
df = df_orig.copy()

         Customer      Sales
0  Jones Brothers        500
1       Beta Corp  $1,000.00
2     Globex Corp      300.1
3            Acme    $750.01
4         Initech        300
5           Hooli        250

In [72]:
df["Sales"] = (
    df["Sales"]
    .apply(lambda x: x.replace("$", "").replace(",", "") if isinstance(x, str) else x)
    .astype("float")
)
df['Sales']

0     500.00
1    1000.00
2     300.10
3     750.01
4     300.00
5     250.00
Name: Sales, dtype: float64

In [73]:
df = df_orig.copy()
df

df['Sales'] = df['Sales'].replace({'\$': '', ',': ''}, regex=True)

In [75]:
df.head()

         Customer    Sales
0  Jones Brothers      500
1       Beta Corp  1000.00
2     Globex Corp    300.1
3            Acme   750.01
4         Initech      300

In [80]:
df['Sales'].apply(type).value_counts()

Sales
<class 'float'>    6
Name: count, dtype: int64

In [83]:
# df = df_orig.copy()
# df['Sales'] = df['Sales'].str.replace(',','').str.replace('$','').astype('float')
# df['Sales']